Store/src/Documents/ПоступлениеТовара/ПоступлениеТовара.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПоступлениеТовара</name>
  <registerRecords>AccumulationRegister.ТоварыНаСкладе</registerRecords>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Store/src/AccumulationRegisters/ТоварыНаСкладе/ТоварыНаСкладе.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ТоварыНаСкладе</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Склад</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Store/src/Documents/ПоступлениеТовара/Forms/ФормаДокумента/Module.bsl
#Область ОбработчикиСобытийЭлементовТаблицыФормыТовары

&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент)

	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	ТекстПользователю = "Ввели количество";

	РассчитатьСуммуСтроки(ТекущиеДанные, ТекстПользователю);

КонецПроцедуры

&НаКлиенте
Процедура ТоварыЦенаПриИзменении(Элемент)

	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	ТекстПользователю = "Поменялась цена";

	РассчитатьСуммуСтроки(ТекущиеДанные, ТекстПользователю);

КонецПроцедуры



&НаКлиенте
Процедура ТоварыНоменклатураПриИзменении(Элемент)
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ТекущиеДанные.Номенклатура = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПолучитьИПоказатьОстаткиПоНоменклатуре(ТекущиеДанные.Номенклатура);
КонецПроцедуры
#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура РассчитатьСуммуСтроки(Строка, Сообщение)

	Строка.Сумма = Строка.Цена * Строка.Количество;
	Сообщение = Новый СообщениеПользователю;
	Сообщение.Текст = Сообщение;
	Сообщение.Сообщить();
	Человек = ОписаниеСотрудника();
	Сообщение = Новый СообщениеПользователю;
	Сообщение.Текст = Человек.Имя;
	Сообщение.Сообщить();

КонецПроцедуры

&НаКлиенте
Функция ОписаниеСотрудника()

	Сотрудник = Новый Структура;
	Сотрудник.Вставить("Имя", "Антон");
	Сотрудник.Вставить("ДатаРождения", ТекущаяДата());
	Сотрудник.Вставить("СтажЛет", 15);
	Сотрудник.Вставить("Штатный", Ложь);

	Возврат Сотрудник;

КонецФункции

&НаКлиенте
Процедура ПолучитьИПоказатьОстаткиПоНоменклатуре(Номенклатура)
	Остатки = ПолучитьОстаткиПоНоменклатуреНаСервере(Номенклатура);
	
	Если Остатки.Количество() = 0 Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Нет остатков по данной номенклатуре";
		Сообщение.Сообщить();
	Иначе
		Для Каждого Остаток Из Остатки Цикл
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = СтрШаблон("Склад: %1, Остаток: %2", Остаток.Ключ, Остаток.Значение);
			Сообщение.Сообщить();
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьОстаткиПоНоменклатуреНаСервере(Знач Номенклатура)
	Склады = ПолучитьСписокСкладов();
	Возврат РегистрыНакопления.ТоварыНаСкладе.ОстатокПоНоменклатуре(Номенклатура, Склады);
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьСписокСкладов()
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РАЗЛИЧНЫЕ ТоварыНаСкладе.Склад КАК Склад
		|ИЗ
		|	РегистрНакопления.ТоварыНаСкладе КАК ТоварыНаСкладе";
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Склады = Новый Массив;
	Пока Выборка.Следующий() Цикл
		Склады.Добавить(Выборка.Склад);
	КонецЦикла;
	
	Возврат Склады;
КонецФункции


#КонецОбласти
